{
  "vocab": {
    "1": 1,
    "2": 2,
    "4": 3,
    "5": 4,
    "8": 5,
    "9": 6,
    "10": 7,
    "11": 8,
    "12": 9,
    "13": 10,
    "14": 11,
    "15": 12,
    "16": 13,
    "17": 14,
    "18": 15,
    "21": 16,
    "22": 17,
    "24": 18,
    "25": 19,
    "26": 20,
    "27": 21,
    "32": 22,
    "34": 23,
    "35": 24,
    "37": 25,
    "39": 26,
    "40": 27,
    "42": 28,
    "46": 29,
    "47": 30,
    "48": 31,
    "49": 32,
    "50": 33,
    "51": 34,
    "53": 35,
    "54": 36,
    "58": 37,
    "61": 38,
    "63": 39,
    "64": 40,
    "65": 41,
    "67": 42,
    "70": 43,
    "74": 44,
    "75": 45,
    "77": 46,
    "79": 47,
    "80": 48,
    "81": 49,
    "82": 50,
    "83": 51,
    "84": 52,
    "85": 53,
    "86": 54,
    "92": 55,
    "110": 56,
    "163": 57,
    "166": 58,
    "276": 59,
    "277": 60,
    "278": 61,
    "279": 62,
    "280": 63,
    "290": 64,
    "292": 65,
    "293": 66,
    "294": 67,
    "296": 68,
    "297": 69,
    "298": 70,
    "299": 71,
    "301": 72,
    "303": 73,
    "307": 74,
    "308": 75,
    "309": 76,
    "310": 77,
    "311": 78,
    "312": 79,
    "314": 80,
    "317": 81,
    "322": 82,
    "323": 83,
    "325": 84,
    "346": 85,
    "350": 86,
    "368": 87,
    "375": 88,
    "378": 89
  },
  "vocab_size": 90,
  "idx_to_name": {
    "0": "Misc/Other",
    "1": "Box and Whisker",
    "2": "Circle Graph",
    "3": "Histogram as Table or Graph",
    "4": "Number Line",
    "5": "Scatter Plot",
    "6": "Stem and Leaf Plot",
    "7": "Table",
    "8": "Venn Diagram",
    "9": "Mean",
    "10": "Median",
    "11": "Mode",
    "12": "Range",
    "13": "Counting Methods",
    "14": "Probability of Two Distinct Events",
    "15": "Probability of a Single Event",
    "16": "Interior Angles Figures with More than 3 Sides",
    "17": "Interior Angles Triangle",
    "18": "Congruence",
    "19": "Complementary and Supplementary Angles",
    "20": "Angles on Parallel Lines Cut by a Transversal",
    "21": "Pythagorean Theorem",
    "22": "Nets of 3D Figures",
    "23": "Unit Conversion Within a System",
    "24": "Effect of Changing Dimensions of a Shape Prportionally",
    "25": "Skill_37",
    "26": "Area Circle",
    "27": "Circumference ",
    "28": "Perimeter of a Polygon",
    "29": "Calculations with Similar Figures",
    "30": "Conversion of Fraction Decimals Percents",
    "31": "Equivalent Fractions",
    "32": "Ordering Positive Decimals",
    "33": "Ordering Fractions",
    "34": "Ordering Integers",
    "35": "Ordering Real Numbers",
    "36": "Rounding",
    "37": "Addition Whole Numbers",
    "38": "Division Fractions",
    "39": "Estimation",
    "40": "Fraction Of",
    "41": "Least Common Multiple",
    "42": "Multiplication Fractions",
    "43": "Percent Of",
    "44": "Subtraction Whole Numbers",
    "45": "Square Root",
    "46": "Finding Percents",
    "47": "Proportion",
    "48": "Scale Factor",
    "49": "Unit Rate",
    "50": "Scientific Notation",
    "51": "Divisibility Rules",
    "52": "Prime Number",
    "53": "Absolute Value",
    "54": "Exponents",
    "55": "Pattern Finding ",
    "56": "D.4.8-understanding-concept-of-probabilities",
    "57": "Absolute Value",
    "58": "Algebraic Solving",
    "59": "Multiplication and Division Positive Decimals",
    "60": "Addition and Subtraction Integers",
    "61": "Addition and Subtraction Positive Decimals",
    "62": "Multiplication and Division Integers",
    "63": "Addition and Subtraction Fractions",
    "64": "Reflection",
    "65": "Rotations",
    "66": "Translations",
    "67": "Area Irregular Figure",
    "68": "Area Rectangle",
    "69": "Area Trapezoid",
    "70": "Area Triangle",
    "71": "Surface Area Cylinder",
    "72": "Surface Area Rectangular Prism",
    "73": "Volume Cylinder",
    "74": "Volume Rectangular Prism",
    "75": "Volume Sphere",
    "76": "Order of Operations +,-,/,* () positive reals",
    "77": "Order of Operations All",
    "78": "Equation Solving Two or Fewer Steps",
    "79": "Equation Solving More Than Two Steps",
    "80": "Angles - Obtuse, Acute, and Right",
    "81": "Greatest Common Factor",
    "82": "Write Linear Equation from Ordered Pairs",
    "83": "Write Linear Equation from Situation",
    "84": "Write Linear Equation from Graph",
    "85": "Polynomial Factors",
    "86": "Solving Systems of Linear Equations",
    "87": "Solving for a variable",
    "88": "Solving Inequalities",
    "89": "Solving Systems of Linear Equations by Graphing"
  },
  "skill_id_to_name": {
    "10": "Table",
    "12": "Mean",
    "13": "Median",
    "279": "Multiplication and Division Integers",
    "311": "Equation Solving Two or Fewer Steps",
    "312": "Equation Solving More Than Two Steps",
    "278": "Addition and Subtraction Positive Decimals",
    "86": "Exponents",
    "5": "Number Line",
    "375": "Solving Inequalities",
    "340": "Distributive Property",
    "277": "Addition and Subtraction Integers",
    "24": "Congruence",
    "54": "Rounding",
    "67": "Multiplication Fractions",
    "280": "Addition and Subtraction Fractions",
    "58": "Addition Whole Numbers",
    "51": "Ordering Integers",
    "49": "Ordering Positive Decimals",
    "309": "Order of Operations +,-,/,* () positive reals",
    "368": "Solving for a variable",
    "301": "Surface Area Rectangular Prism",
    "32": "Nets of 3D Figures",
    "46": "Calculations with Similar Figures",
    "18": "Probability of a Single Event",
    "64": "Fraction Of",
    "15": "Range",
    "14": "Mode",
    "47": "Conversion of Fraction Decimals Percents",
    "74": "Subtraction Whole Numbers",
    "85": "Absolute Value",
    "50": "Ordering Fractions",
    "79": "Proportion",
    "110": "D.4.8-understanding-concept-of-probabilities",
    "25": "Complementary and Supplementary Angles",
    "40": "Circumference ",
    "39": "Area Circle",
    "34": "Unit Conversion Within a System",
    "81": "Unit Rate",
    "69": "Multiplication Whole Numbers",
    "70": "Percent Of",
    "276": "Multiplication and Division Positive Decimals",
    "61": "Division Fractions",
    "83": "Divisibility Rules",
    "65": "Least Common Multiple",
    "53": "Ordering Real Numbers",
    "75": "Square Root",
    "310": "Order of Operations All",
    "84": "Prime Number",
    "77": "Finding Percents",
    "63": "Estimation",
    "82": "Scientific Notation",
    "27": "Pythagorean Theorem",
    "343": "Midpoint",
    "8": "Scatter Plot",
    "92": "Pattern Finding ",
    "11": "Venn Diagram",
    "2": "Circle Graph",
    "48": "Equivalent Fractions",
    "9": "Stem and Leaf Plot",
    "104": "Skill_104",
    "4": "Histogram as Table or Graph",
    "1": "Box and Whisker",
    "322": "Write Linear Equation from Ordered Pairs",
    "325": "Write Linear Equation from Graph",
    "323": "Write Linear Equation from Situation",
    "292": "Rotations",
    "290": "Reflection",
    "37": "Skill_37",
    "42": "Perimeter of a Polygon",
    "80": "Scale Factor",
    "293": "Translations",
    "21": "Interior Angles Figures with More than 3 Sides",
    "22": "Interior Angles Triangle",
    "16": "Counting Methods",
    "17": "Probability of Two Distinct Events",
    "26": "Angles on Parallel Lines Cut by a Transversal",
    "294": "Area Irregular Figure",
    "307": "Volume Rectangular Prism",
    "365": "Interpreting Coordinate Graphs ",
    "297": "Area Trapezoid",
    "296": "Area Rectangle",
    "295": "Area Parallelogram",
    "299": "Surface Area Cylinder",
    "308": "Volume Sphere",
    "298": "Area Triangle",
    "321": "Computation with Real Numbers",
    "173": "Choose an Equation from Given Information",
    "190": "Intercept",
    "193": "Linear Equations",
    "221": "Slope",
    "303": "Volume Cylinder",
    "35": "Effect of Changing Dimensions of a Shape Prportionally",
    "356": "Quadratic Formula to Solve Quadratic Equation",
    "317": "Greatest Common Factor",
    "324": "Recognize Linear Pattern",
    "314": "Angles - Obtuse, Acute, and Right",
    "102": "Skill_102",
    "166": "Algebraic Solving",
    "163": "Absolute Value",
    "204": "Percents",
    "217": "Rate",
    "203": "Percent Discount",
    "165": "Algebraic Simplification",
    "43": "Reading a Ruler or Scale",
    "378": "Solving Systems of Linear Equations by Graphing",
    "350": "Solving Systems of Linear Equations",
    "346": "Polynomial Factors",
    "371": "Simplifying Expressions positive exponents",
    "334": "Finding Slope from Ordered Pairs",
    "331": "Finding Slope From Situation",
    "362": "Parts of a Polyomial, Terms, Coefficient, Monomial, Exponent, Variable",
    "333": "Finding Slope From Equation",
    "348": "Recognize Quadratic Pattern"
  }
}